KeyDB_test_by_memtier_benchmark/KeyDB_test_by_memtier_benchmark_L_ON_2nd/PrepareData_KeyDB_test_L_ON_2nd_20230415110932.txt
50        Threads
8         Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       244043.74          ---          ---        52.83246        41.98300       193.53500       319.48700     79065.28 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     244043.74         0.00         0.00        52.83246        41.98300       193.53500       319.48700     79065.28 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.239        0.000
SET      15.935        5.000
SET      25.727       10.000
SET      30.847       15.000
SET      33.279       20.000
SET      35.071       25.000
SET      36.351       30.000
SET      37.631       35.000
SET      39.167       40.000
SET      40.447       45.000
SET      41.983       50.000
SET      42.751       52.500
SET      43.775       55.000
SET      44.799       57.500
SET      46.079       60.000
SET      47.615       62.500
SET      49.663       65.000
SET      52.735       67.500
SET      56.831       70.000
SET      62.719       72.500
SET      67.583       75.000
SET      69.631       76.250
SET      71.167       77.500
SET      73.215       78.750
SET      74.751       80.000
SET      76.287       81.250
SET      77.311       82.500
SET      78.847       83.750
SET      79.871       85.000
SET      81.407       86.250
SET      82.943       87.500
SET      83.455       88.125
SET      84.479       88.750
SET      85.503       89.375
SET      86.015       90.000
SET      87.039       90.625
SET      88.575       91.250
SET      89.599       91.875
SET      91.135       92.500
SET      93.183       93.125
SET      95.743       93.750
SET      97.791       94.062
SET     100.351       94.375
SET     103.423       94.688
SET     107.519       95.000
SET     113.151       95.312
SET     118.271       95.625
SET     123.391       95.938
SET     130.559       96.250
SET     140.287       96.562
SET     150.527       96.875
SET     154.623       97.031
SET     157.695       97.188
SET     160.767       97.344
SET     163.839       97.500
SET     166.911       97.656
SET     168.959       97.812
SET     172.031       97.969
SET     175.103       98.125
SET     178.175       98.281
SET     180.223       98.438
SET     182.271       98.516
SET     183.295       98.594
SET     184.319       98.672
SET     187.391       98.750
SET     188.415       98.828
SET     191.487       98.906
SET     193.535       98.984
SET     194.559       99.062
SET     197.631       99.141
SET     200.703       99.219
SET     202.751       99.258
SET     203.775       99.297
SET     204.799       99.336
SET     205.823       99.375
SET     207.871       99.414
SET     208.895       99.453
SET     210.943       99.492
SET     215.039       99.531
SET     220.159       99.570
SET     225.279       99.609
SET     228.351       99.629
SET     230.399       99.648
SET     235.519       99.668
SET     239.615       99.688
SET     244.735       99.707
SET     246.783       99.727
SET     250.879       99.746
SET     254.975       99.766
SET     261.119       99.785
SET     270.335       99.805
SET     272.383       99.814
SET     276.479       99.824
SET     280.575       99.834
SET     284.671       99.844
SET     290.815       99.854
SET     294.911       99.863
SET     303.103       99.873
SET     309.247       99.883
SET     315.391       99.893
SET     319.487       99.902
SET     323.583       99.907
SET     325.631       99.912
SET     327.679       99.917
SET     329.727       99.922
SET     329.727       99.927
SET     333.823       99.932
SET     337.919       99.937
SET     346.111       99.941
SET     348.159       99.946
SET     356.351       99.951
SET     356.351       99.954
SET     360.447       99.956
SET     360.447       99.958
SET     360.447       99.961
SET     362.495       99.963
SET     364.543       99.966
SET     370.687       99.968
SET     374.783       99.971
SET     376.831       99.973
SET     378.879       99.976
SET     380.927       99.977
SET     382.975       99.978
SET     385.023       99.979
SET     387.071       99.980
SET     387.071       99.982
SET     389.119       99.983
SET     391.167       99.984
SET     393.215       99.985
SET     393.215       99.987
SET     393.215       99.988
SET     395.263       99.988
SET     395.263       99.989
SET     395.263       99.990
SET     395.263       99.990
SET     397.311       99.991
SET     397.311       99.991
SET     397.311       99.992
SET     397.311       99.993
SET     397.311       99.993
SET     399.359       99.994
SET     399.359       99.994
SET     399.359       99.995
SET     401.407       99.995
SET     401.407       99.995
SET     401.407       99.995
SET     401.407       99.996
SET     401.407       99.996
SET     401.407       99.996
SET     401.407       99.997
SET     401.407       99.997
SET     401.407       99.997
[...]
SET     403.455       99.997
SET     403.455       99.998
SET     403.455       99.998
SET     403.455       99.998
[...]
SET     405.503       99.998
SET     405.503       99.998
SET     405.503       99.999
SET     405.503       99.999
SET     405.503       99.999
[...]
SET     405.503      100.000
SET     411.647      100.000
SET     411.647      100.000
---
GET       0.000      100.000
---
WAIT      0.000      100.000